import json

import pytest
from pandas import DataFrame

def get_data():
    return {
            "Дата операции":[
                "31.12.2021 16:44:00",
                "31.12.2021 16:42:04",
                "31.12.2021 01:23:42",
                "30.12.2021 19:18:22"
            ],
            "Дата платежа":[
                "31.12.2021",
                "31.12.2021",
                "31.12.2021",
                "30.12.2021"
            ],
            "Номер карты":[
                "*7197",
                "*7197",
                "*5091",
                "*5091"
            ],
            "Статус":[
                "OK",
                "OK",
                "OK",
                "FAILED"
            ],
            "Сумма операции":[
                  -160.89,
                  -64.00,
                  -564.00,
                  -7.07
            ],
            "Валюта операции":[
                "RUB",
                "RUB",
                "RUB",
                "RUB"
            ],
            "Сумма платежа":[
                  -160.89,
                  -64.00,
                  -564.00,
                  -7.07
            ],
            "Валюта платежа":[
                "RUB",
                "RUB",
                "RUB",
                "RUB"
            ],
            "Кэшбэк":[
                0,
                0,
                0,
                0
            ],
            "Категория":[
                "Супермаркеты",
                "Супермаркеты",
                "Различные товары",
                "Каршеринг"
            ],
            "MCC":[
                5411,
                5411,
                5399,
                7512
            ],
            "Описание":[
                "Колхоз",
                "Колхоз",
                "Ozon.ru",
                "Ситидрайв"
            ],
            "Бонусы(включая кэшбэк)":[
                3,
                1,
                5,
                0
            ],
            "Округление на инвесткопилку":[
                0,
                0,
                0,
                0
            ],
            "Сумма операции с округлением":[
                160.89,
                64.00,
                564.00,
                7.07,
            ]
        }

@pytest.fixture
def dataframe_for_tests():
    return DataFrame(get_data())

@pytest.fixture
def json_for_tests():
    return json.loads(DataFrame(get_data()).to_json(orient="records"))


